
__doc__='''模板AI函数

接收参数包含两部分：游戏数据与函数存储
需返回字符串表示的转向标记

游戏数据：字典，包含当前游戏状态信息
内容：
    turnleft : 剩余回合数
    timeleft : 双方剩余思考时间
    fields : 纸片场地二维列表
    bands : 纸带场地二维列表
    players : 玩家信息列表，包含先后手玩家信息
    me : 该玩家信息
    enemy : 对手玩家信息

函数存储：字典，可供play函数自由使用，存储数据；同时记录了一些默认的数据
默认数据内容：
    size : 列表，包含游戏场景宽高 [width, height]
    log : 运行记录，包含对局开始以来每一回合的游戏数据

函数返回值：若返回值为非空字符串且首字母大写为L或R，则对应左转与右转操作；否则视为直行
分类：
    识别为“左转”：'l', 'L', 'Left', 'LEFT', 'Legendary' ...
    识别为“右转”：'r', 'R', 'right', 'RIGHT', 'Robust' ...
    识别为“前进”：None, 'iwannawin', [1, 2, 3] ...
'''

def play(stat,):
    '''
    AI函数

    params:
        stat - 游戏数据
        storage - 游戏存储

    returns:
        1. 首字母为'l'或'L'的字符串 - 代表左转
        2. 首字母为'r'或'R'的字符串 - 代表左转
        3. 其余 - 代表直行
    '''
    pass
