__doc__ = '''模板AI函数

接收参数包含两部分：游戏数据与函数存储
需返回字符串表示的转向标记

游戏数据：字典，包含当前游戏状态信息
内容：
    turnleft : 剩余回合数，按先后手排序
    timeleft : 双方剩余思考时间，按先后手排序
    fields : 纸片场地二维列表
    bands : 纸带场地二维列表
    players : 玩家信息列表，包含双方玩家信息，按先后手排序
    me : 自己控制的玩家信息
    enemy : 对手玩家信息

游戏数据-玩家信息：当前游戏状态中一个玩家的状态
内容：
    id : 玩家标记（1或2）
    x : 横坐标（场地数组下标1）
    y : 纵坐标（场地数组下标2）
    direction : 数字标记的当前方向
        0 : 向东
        1 : 向南
        2 : 向西
        3 : 向北

函数存储：字典，可供play函数自由使用，存储数据；同时记录了一些默认的数据
默认数据内容：
    size : 列表，包含游戏场景宽高 [width, height]
    log : 运行记录，包含对局开始以来每一回合的游戏数据

函数返回值：若返回值为非空字符串且首字母大写为L或R，则对应左转与右转操作；否则视为直行
分类：
    识别为“左转”：'l', 'L', 'Left', 'LEFT', 'Legendary' ...
    识别为“右转”：'r', 'R', 'right', 'RIGHT', 'Robust' ...
    识别为“前进”：None, 'iwannawin', [1, 2, 3] ...
'''


def play(stat, storage):
    '''
    AI函数

    params:
        stat - 游戏数据
        storage - 游戏存储

    returns:
        1. 首字母为'l'或'L'的字符串 - 代表左转
        2. 首字母为'r'或'R'的字符串 - 代表右转
        3. 其余 - 代表直行
    '''
    pass
